<a href="https://colab.research.google.com/github/2303A510G2/PDS/blob/main/PDS_%5B06%5D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **CH. UDAY**
# **2303A510G2**

In [2]:
import pandas as pd

data = {
    'TransactionID': [101, 102, 103, 104, 105, 106, 103, 105],
    'CustomerID': ['C001', 'C002', 'C003', 'C004', 'C005', 'C006', 'C003', 'C005'],
    'Product': ['Shoes', 'Shirt', 'Watch', 'Shoes', 'Belt', 'Hat', 'Watch', 'Belt'],
    'Amount': [59.99, 29.99, 199.99, 89.99, 19.99, 24.99, 199.99, 19.99],
    'Date': ['2023-09-01', '2023-09-02', '2023-09-03', '2023-09-04',
             '2023-09-05', '2023-09-06', '2023-09-03', '2023-09-05']
}

df = pd.DataFrame(data)

print("Original Dataset:")
print(df)

duplicate_rows = df[df.duplicated()]
print("\nDuplicate Rows:")
print(duplicate_rows)

before_count = len(df)
print(f"\nNumber of rows before removing duplicates: {before_count}")

df_cleaned = df.drop_duplicates()

after_count = len(df_cleaned)
print(f"Number of rows after removing duplicates: {after_count}")

print("\nCleaned Dataset:")
print(df_cleaned)

Original Dataset:
   TransactionID CustomerID Product  Amount        Date
0            101       C001   Shoes   59.99  2023-09-01
1            102       C002   Shirt   29.99  2023-09-02
2            103       C003   Watch  199.99  2023-09-03
3            104       C004   Shoes   89.99  2023-09-04
4            105       C005    Belt   19.99  2023-09-05
5            106       C006     Hat   24.99  2023-09-06
6            103       C003   Watch  199.99  2023-09-03
7            105       C005    Belt   19.99  2023-09-05

Duplicate Rows:
   TransactionID CustomerID Product  Amount        Date
6            103       C003   Watch  199.99  2023-09-03
7            105       C005    Belt   19.99  2023-09-05

Number of rows before removing duplicates: 8
Number of rows after removing duplicates: 6

Cleaned Dataset:
   TransactionID CustomerID Product  Amount        Date
0            101       C001   Shoes   59.99  2023-09-01
1            102       C002   Shirt   29.99  2023-09-02
2            103       C003   Watch  199.99  2023-09-03
3            104       C004   Shoes   89.99  2023-09-04
4            105       C005    Belt   19.99  2023-09-05
5            106       C006     Hat   24.99  2023-09-06

In [3]:
import pandas as pd

data = {
    'EmployeeID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Salary': ['55000', '62000', '58000', '60000'],
    'Joining_Date': ['2021-01-15', '2020-07-23', '2022-03-01', '2019-11-30']
}

df = pd.DataFrame(data)

print("Original Data Types:\n")
print(df.dtypes)

df['Salary'] = pd.to_numeric(df['Salary'])
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

print("\nData Types After Conversion:\n")
print(df.dtypes)

print("\nConverted Dataset:\n")
print(df)

Original Data Types:

EmployeeID       int64
Name            object
Salary          object
Joining_Date    object
dtype: object

Data Types After Conversion:

EmployeeID               int64
Name                    object
Salary                   int64
Joining_Date    datetime64[ns]
dtype: object

Converted Dataset:

   EmployeeID     Name  Salary Joining_Date
0           1    Alice   55000   2021-01-15
1           2      Bob   62000   2020-07-23
2           3  Charlie   58000   2022-03-01
3           4    Diana   60000   2019-11-30